# BuiltInFailures.ImportExportFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImportExportFailures Class
BuiltInFailures Class Members See Also
---
Failures about Import and Export.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ImportExportFailures
```

Visual Basic
---
```text
Public NotInheritable Class ImportExportFailures
```

Visual C++
---
```text
public ref class ImportExportFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ImportExportFailures
# See Also
BuiltInFailures..::..ImportExportFailures Members
Autodesk.Revit.DB Namespace